lesson_type_icons = {
    "Лекция": "🌀",
    "Практика": "💠",
    "К/П": "📙",
    "Лабораторная": "🫧",
    "К/Р": "💯",
}

legend = {
    "🔸": "Четная неделя",
    "🔹": "Нечетная неделя",
    "🔘": "Определенный день",
    "📌": "Текущий день",
    
    lesson_type_icons["Лабораторная"]: "Лабораторная",
    lesson_type_icons['Практика']: "Практика",
    lesson_type_icons['Лекция']: "Лекция",
    lesson_type_icons["К/П"]: "К/П",
    lesson_type_icons["К/Р"]: "К/Р",
    
    "📍": "Место проведения занятий",
    "7-": "Корпус на 7-ой Красноармейской"
}

except_icons = ["🔹", "🔸"]

week_types = {
    "odd": "🔹 Нечетная неделя",
    "even": "🔸 Четная неделя"
}

lessons_time = {
    "1": "09:30-11:10",
    "2": "11:30-13:10", 
    "3": "14:00-15:40", 
    "4": "16:00-17:40", 
    "5": "18:00-19:40",
    "6": "20:00-21:40"
}

days_of_week = {
    0: "monday",
    1: "tuesday",
    2: "wednesday",
    3: "thursday",
    4: "friday",
    5: "saturday",
    6: "sunday"
}

rus_days_of_week = {
    "monday": "Понедельник",
    "tuesday": "Вторник",
    "wednesday": "Среда",
    "thursday": "Четверг",
    "friday": "Пятница",
    "saturday": "Суббота",
    "sunday": "Воскресенье"
}